# IFC_SetPsetProp

## Description
Sets the value of a selected property from a property set

```pascal
FUNCTION IFC_SetPsetProp(
				hObject        : HANDLE;
				inStrPsetName  : STRING;
				inStrPropName  : STRING;
				inStrPropValue : STRING) : BOOLEAN;
```

```python

def vs.IFC_SetPsetProp(hObject, inStrPsetName, inStrPropName, inStrPropValue):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|inStrPsetName|STRING||
|inStrPropName|STRING||
|inStrPropValue|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* IFC